app/controllers/contacts_controller.rb

  def create
    @contact = current_user.contacts.build(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("name", "phone", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Gabriel"], ["phone", "996665279"], ["created_at", "2020-09-24 18:05:16.472446"], ["updated_at", "2020-09-24 18:05:16.472446"], ["user_id", 3]]

  def update
    respond_to do |format|
      if @contact.update(contact_params)
---
UPDATE "contacts" SET "name" = $1, "updated_at" = $2 WHERE "contacts"."id" = $3  [["name", "Lucas"], ["updated_at", "2020-09-24 18:25:47.973150"], ["id", 6]]

    def set_contact
      @contact = current_user.contacts.find(params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."user_id" = $1 AND "contacts"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 3], ["LIMIT", 1]]