app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("email", "name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def update
        if current_user.update(user_params)
---
UPDATE "users" SET "name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Jonas Gabriel Bervian"], ["password_digest", "$2a$12$RjzfbZxQQRPvRIEQOHUxJeZy.LS.9HwfvbhiGLQq9m28clH/0WrR6"], ["updated_at", "2020-09-24 18:50:05.479129"], ["id", 2]]